#+title: New Caledonia
#+options: toc:nil title:t num:nil author:nil ^:{}
#+property: header-args:python :results output :session :exports both
#+property: header-args :eval never-export
#+export_select_tags: export
#+export_exclude_tags: noexport

* Downloading data in parallel

We can use =geefcc= to download forest cover change for large countries, for example New-Caledonia. The country will be divided into several tiles which are processed in parallel. If your computer has n cores, n-1 cores will be used in parallel.

#+begin_src python
import os
import time

import ee
import numpy as np
import pandas as pd
from osgeo import gdal
from geefcc import get_fcc, sum_raster_bands
import geopandas
import matplotlib.pyplot as plt
from matplotlib.colors import ListedColormap
import matplotlib.patches as mpatches
from tabulate import tabulate
#+end_src

#+RESULTS:

We initialize Google Earth Engine.

#+begin_src python
# Initialize GEE
ee.Initialize(project="deforisk",
              opt_url=("https://earthengine-highvolume."
                       "googleapis.com"))
#+end_src

#+RESULTS:

We can compute the number of cores used for the computation.

#+begin_src python :results value
ncpu = os.cpu_count() - 1
ncpu
#+end_src

#+RESULTS:
: 7

** Downloading data

We download the forest cover change data from GEE for New Caledonia for years 2001, 2010 and 2020, using a tile size of one degree. We use the TMF product (version ~v1_2023~ available in geefcc).

#+begin_src python
start_time = time.time()
get_fcc(
    aoi=(163.5, -23, 168.15, -19.51),
    buff=0.0,
    years=[2001, 2010, 2020],
    source="tmf",
    tile_size=1.0,
    crop_to_aoi=True,
    output_file="out_tmf/forest_tmf.tif",
)
end_time = time.time()
#+end_src

#+RESULTS:

We estimate the computation time to download 20 1-degree tiles using several cores. 

#+begin_src python
elapsed_time = (end_time - start_time) / 60
print('Execution time:', round(elapsed_time, 2), 'minutes')
#+end_src

#+RESULTS:
: Execution time: 9.55 minutes

** Compute statistics

We use the tool "Raster layer unique values report" in QGIS to get the number of pixels per pixel value in the raster.

#+begin_src python :results output :exports both
pixel_count = [n1, n2, n3] = [273463, 257445, 9402021]
areas = [round(i * (30 * 30 / 10000)) for i in pixel_count]
tmf_areas= {"product": "tmf", "version": "v1_2023", "perc": "",
 "fc2001": areas[0] + areas[1] + areas[2],
 "fc2010": areas[1] + areas[2], "fc2020": areas[2],
 "d1": round(areas[0] / 9), "d2": round(areas[1] / 10)}
print(tmf_areas)
#+end_src

#+RESULTS:
: {'product': 'tmf', 'version': 'v1_2023', 'perc': '', 'fc2001': 893964, 'fc2010': 869352, 'fc2020': 846182, 'd1': 2735, 'd2': 2317}

** Downloading data

We download the forest cover change data from GEE for New Caledonia for years 2001, 2010 and 2020, using a tile size of one degree. We use the GFC product (version ~v1_11~ available in geefcc) and a tree cover percentage \geq 80 to define the forest.

#+begin_src python :results none :export code
start_time = time.time()
get_fcc(
    aoi=(163.5, -23, 168.15, -19.51),
    buff=0.0,
    years=[2001, 2010, 2020],
    source="gfc",
    perc=80,
    tile_size=1.0,
    crop_to_aoi=True,
    output_file="out_gfc80/forest_gfc80.tif",
)
end_time = time.time()
#+end_src

We estimate the computation time to download 20 1-degree tiles using several cores. 

#+begin_src python
elapsed_time = (end_time - start_time) / 60
print('Execution time:', round(elapsed_time, 2), 'minutes')
#+end_src

#+RESULTS:
: Execution time: 9.1 minutes

** Compute statistics

#+begin_src python :results output :exports both
pixel_count = [n1, n2, n3] = [41629, 27698, 7276643]
areas = [round(i * (30 * 30 / 10000)) for i in pixel_count]
gfc80_areas= {"product": "gfc", "version": "v1_11(2023)", "perc": 80,
 "fc2001": areas[0] + areas[1] + areas[2],
 "fc2010": areas[1] + areas[2], "fc2020": areas[2],
 "d1": round(areas[0] / 9), "d2": round(areas[1] / 10)}
print(gfc80_areas)
#+end_src

#+RESULTS:
: {'product': 'gfc', 'version': 'v1_11(2023)', 'perc': 80, 'fc2001': 661138, 'fc2010': 657391, 'fc2020': 654898, 'd1': 416, 'd2': 249}

** Downloading data

We download the forest cover change data from GEE for New Caledonia for years 2000, 2010 and 2020, using a tile size of one degree. We use the GFC product (version ~v1_11~ available in geefcc) and a tree cover percentage \geq 60 to define the forest.

#+begin_src python :results none :export code
start_time = time.time()
get_fcc(
    aoi=(163.5, -23, 168.15, -19.51),
    buff=0.0,
    years=[2001, 2010, 2020],
    source="gfc",
    perc=60,
    tile_size=1.0,
    crop_to_aoi=True,
    output_file="out_gfc60/forest_gfc60.tif",
)
end_time = time.time()
#+end_src

We estimate the computation time to download 20 1-degree tiles using several cores. 

#+begin_src python
elapsed_time = (end_time - start_time) / 60
print('Execution time:', round(elapsed_time, 2), 'minutes')
#+end_src

#+RESULTS:
: Execution time: 8.87 minutes

** Compute statistics

#+begin_src python :results output :exports both
pixel_count = [n1, n2, n3] = [73891, 60240, 9860795]
areas = [round(i * (30 * 30 / 10000)) for i in pixel_count]
gfc60_areas= {"product": "gfc", "version": "v1_11(2023)", "perc": 60,
 "fc2001": areas[0] + areas[1] + areas[2],
 "fc2010": areas[1] + areas[2], "fc2020": areas[2],
 "d1": round(areas[0] / 9), "d2": round(areas[1] / 10)}
print(gfc60_areas)
#+end_src

#+RESULTS:
: {'product': 'gfc', 'version': 'v1_11(2023)', 'perc': 60, 'fc2001': 899544, 'fc2010': 892894, 'fc2020': 887472, 'd1': 739, 'd2': 542}

